IRP/src/Catalogs/SystemAttributesSets/SystemAttributesSets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SystemAttributesSets</name>
  <predefined>
    <items>
      <name>Document_SalesOrder</name>
    </items>
    <items>
      <name>Document_SalesInvoice</name>
    </items>
    <items>
      <name>Document_SalesReturnOrder</name>
    </items>
    <items>
      <name>Document_SalesReturn</name>
    </items>
    <items>
      <name>Document_ShipmentConfirmation</name>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
    </items>
    <items>
      <name>Document_PurchaseInvoice</name>
    </items>
    <items>
      <name>Document_PurchaseReturn</name>
    </items>
    <items>
      <name>Document_PurchaseReturnOrder</name>
    </items>
    <items>
      <name>Document_GoodsReceipt</name>
    </items>
    <items>
      <name>Document_RetailGoodsReceipt</name>
    </items>
    <items>
      <name>Document_RetailReceiptCorrection</name>
    </items>
    <items>
      <name>Document_RetailReturnReceipt</name>
    </items>
    <items>
      <name>Document_RetailSalesReceipt</name>
    </items>
    <items>
      <name>Document_RetailShipmentConfirmation</name>
    </items>
    <items>
      <name>Document_PurchaseOrderClosing</name>
    </items>
    <items>
      <name>Document_SalesOrderClosing</name>
    </items>
    <items>
      <name>Document_CommissioningOfFixedAsset</name>
    </items>
    <items>
      <name>Document_DecommissioningOfFixedAsset</name>
    </items>
    <items>
      <name>Document_ModernizationOfFixedAsset</name>
    </items>
    <items>
      <name>Document_ShipmentPlaningOrder</name>
    </items>
    <items>
      <name>Document_PlannedReceiptReservation</name>
    </items>
  </predefined>
  <tabularSections>
    <name>Attributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.SystemAttributes</types>
      </type>
    </attributes>
    <attributes>
      <name>Collection</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/SystemAttributesSets/Forms/ListForm/Module.bsl
&AtClient
Procedure FillByDefault(Command)
	FillByDefaultAtServer();
EndProcedure

&AtServer
Procedure FillByDefaultAtServer()
	Query = New Query();
	Query.Text = 
	"SELECT
	|	SystemAttributesSets.Ref,
	|	SystemAttributesSets.PredefinedDataName
	|FROM
	|	Catalog.SystemAttributesSets AS SystemAttributesSets
	|WHERE
	|	NOT SystemAttributesSets.DeletionMark
	|	AND SystemAttributesSets.Predefined";
	
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	While QuerySelection.Next() Do
		Obj = QuerySelection.Ref.GetObject();
		Obj.Attributes.Clear();
		
		DocMetadata = Metadata.Documents[StrSplit(QuerySelection.PredefinedDataName ,"_")[1]];
		If DocMetadata.TabularSections.Find("ItemList") <> Undefined
			And DocMetadata.TabularSections.ItemList.Attributes.Find("Store") <> Undefined Then
			
			NewRow = Obj.Attributes.Add();
			NewRow.Attribute = ChartsOfCharacteristicTypes.SystemAttributes.Store;
			NewRow.Collection = True;
		EndIf;
		
		Obj.Write();
	EndDo;	
EndProcedure
